--- Command: show running-config ---
Building configuration...

Current configuration:
!
frr version 8.4_git
frr defaults traditional
hostname 81934fdbd1ad
domainname localdomain
no ipv6 forwarding
!
interface eth0
 ip address 192.168.10.11/24
exit
!
interface eth1
 ip address 192.168.20.11/24
exit
!
interface lo
 ip address 1.1.1.1/32
exit
!
router ospf
 network 1.1.1.1/32 area 0
 network 192.168.10.0/24 area 0
 network 192.168.20.0/24 area 0
exit
!
end

--- Command: show ip route ---
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, E - EIGRP, N - NHRP,
       T - Table, v - VNC, V - VNC-Direct, A - Babel, F - PBR,
       f - OpenFabric,
       > - selected route, * - FIB route, q - queued, r - rejected, b - backup
       t - trapped, o - offload failure

K>* 0.0.0.0/0 [0/0] via 192.168.10.1, eth0, 1d21h53m
O   1.1.1.1/32 [110/0] is directly connected, lo, weight 1, 15:58:15
C>* 1.1.1.1/32 is directly connected, lo, 1d21h53m
O>* 2.2.2.2/32 [110/10] via 192.168.20.21, eth1, weight 1, 15:57:12
O>* 3.3.3.3/32 [110/20] via 192.168.20.21, eth1, weight 1, 15:56:19
O   192.168.10.0/24 [110/10] is directly connected, eth0, weight 1, 1d21h53m
C>* 192.168.10.0/24 is directly connected, eth0, 1d21h53m
O   192.168.20.0/24 [110/10] is directly connected, eth1, weight 1, 1d21h52m
C>* 192.168.20.0/24 is directly connected, eth1, 1d21h53m
O>* 192.168.30.0/24 [110/20] via 192.168.20.21, eth1, weight 1, 1d21h52m

--- Command: show ip interface bri ---
% Unknown command: show ip interface bri